In [2]:
#imports all the packages we need
import pandas as pd
import numpy as np

In [3]:
#series is a one-dimensional labeled array
#we can access elements in the array using assigned labels
my_series = pd.Series(data=[1, 2, 3], index=['A', 'B', 'C'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
#series is flexible with different data types
my_series2 = pd.Series(data=['A', 2, 3], index=[6, 'B', 9])
print(my_series2)
print(type(my_series2))

6    A
B    2
9    3
dtype: object
<class 'pandas.core.series.Series'>

In [5]:
print(f"Accessing first element using my_series[0]: {my_series[0]}")
print(f"Accessing first element using my_series['A']: {my_series['A']}")

Accessing first element using my_series[0]: 1
Accessing first element using my_series['A']: 1

In [6]:
print(f"Accessing first element using my_series[0]: {my_series[1]}")
print(f"Accessing first element using my_series['B']: {my_series['B']}")

Accessing first element using my_series[0]: 2
Accessing first element using my_series['B']: 2

In [7]:
my_series = pd.Series(data={'A': 1, 'B': 2, 'C': 3})
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
my_series = pd.Series(data={1 : 1, 3 : 'N', 'C': 3})
print(my_series)
print(type(my_series))

1    1
3    N
C    3
dtype: object
<class 'pandas.core.series.Series'>

In [9]:
#we can also pass a NumPy array to data
my_series = pd.Series(data=np.array([1, 2, 3]), index=['A', 'B', 'C'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
#we can also pass a NumPy array to data
my_series = pd.Series(data=np.array(['A', 2, 3]), index=[3, 'B', 6])
print(my_series)
print(type(my_series))

3    A
B    2
6    3
dtype: object
<class 'pandas.core.series.Series'>

In [11]:
#this demonstrates the default index
my_series = pd.Series(pd.Series(data=[10, 20, 30]))
print(my_series)
print(type(my_series))

0    10
1    20
2    30
dtype: int64
<class 'pandas.core.series.Series'>

In [12]:
#the following are example series we will use to demonstrate operations we perform on data
week_one = pd.Series(data=[100, 50, 300], index=['Bob', 'Sally', 'Jess'])
week_one

Bob      100
Sally     50
Jess     300
dtype: int64

In [13]:
week_two = pd.Series(data=[500, 30, 20], index=['Bob', 'Sally', 'Jess'])
week_two

Bob      500
Sally     30
Jess      20
dtype: int64

In [14]:
#we can add data between two series with matching indexes
total_due = week_one + week_two
total_due

Bob      600
Sally     80
Jess     320
dtype: int64

In [15]:
#we can also find the difference data between two series
difference = abs(week_one - week_two)
difference

Bob      400
Sally     20
Jess     280
dtype: int64

In [16]:
#another data structure we can use is dataframes
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), index=['A', 'B', 'C', 'D'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
print(my_df)
print(type(my_df))

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
<class 'pandas.core.frame.DataFrame'>

In [17]:
#this prints the values for col2
print(my_df['col2'])
print(type(my_df['col2']))

A     1
B     6
C    11
D    16
Name: col2, dtype: int64
<class 'pandas.core.series.Series'>

In [18]:
#this prints the values for col3
print(my_df['col3'])
print(type(my_df['col3']))

A     2
B     7
C    12
D    17
Name: col3, dtype: int64
<class 'pandas.core.series.Series'>

In [19]:
#DataFrame index labels will also default to [0, n) if not specified
#dataframe looks better if you don't call print on them
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), columns=['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
0     0     1     2     3     4
1     5     6     7     8     9
2    10    11    12    13    14
3    15    16    17    18    19

In [20]:
#this is the dataframe we will use to practice Selection
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), index=['A', 'B', 'C', 'D'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

In [21]:
my_df['col2']

A     1
B     6
C    11
D    16
Name: col2, dtype: int64

In [22]:
my_df['col5']

A     4
B     9
C    14
D    19
Name: col5, dtype: int64

In [23]:
my_df[['col2', 'col3']]

   col2  col3
A     1     2
B     6     7
C    11    12
D    16    17

In [24]:
my_df[['col2', 'col3','col5']]

   col2  col3  col5
A     1     2     4
B     6     7     9
C    11    12    14
D    16    17    19

In [25]:
#this allows us to access row information at index 0
my_df.iloc[0]

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int64

In [26]:
my_df.iloc[3]

col1    15
col2    16
col3    17
col4    18
col5    19
Name: D, dtype: int64

In [27]:
my_df.iloc[2]

col1    10
col2    11
col3    12
col4    13
col5    14
Name: C, dtype: int64

In [28]:
#we can also access row information by referencing the exact name of the row
my_df.loc['A']

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int64

In [29]:
my_df.loc['C']

col1    10
col2    11
col3    12
col4    13
col5    14
Name: C, dtype: int64

In [30]:
#we can also select multiple rows
my_df.iloc[0:3]

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [31]:
my_df.iloc[3:4]

   col1  col2  col3  col4  col5
D    15    16    17    18    19

In [32]:
#we can select multiple rows by referencing the exact row name
my_df.loc['A':'C']

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [33]:
my_df.loc['C':'D']

   col1  col2  col3  col4  col5
C    10    11    12    13    14
D    15    16    17    18    19

In [34]:
#specifies the rows and columns we want
my_df.iloc[1:4, 0:3]

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

In [35]:
my_df.iloc[2:4, 1:2]

   col2
C    11
D    16

In [36]:
#gets the rows and columns we want
my_df.loc['B':'D', 'col1':'col3']

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

In [37]:
my_df.loc['A':'C', 'col2':'col4']

   col2  col3  col4
A     1     2     3
B     6     7     8
C    11    12    13

In [38]:
#we can also pass a numpy array as data
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), index=['A', 'B', 'C', 'D'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

In [39]:
#returns true for even numbers and false otherwise
my_df % 2 == 0

    col1   col2   col3   col4   col5
A   True  False   True  False   True
B  False   True  False   True  False
C   True  False   True  False   True
D  False   True  False   True  False

In [40]:
#returns true for odd numbers and false otherwise
my_df % 2 == 1

    col1   col2   col3   col4   col5
A  False   True  False   True  False
B   True  False   True  False   True
C  False   True  False   True  False
D   True  False   True  False   True

In [41]:
#converts all odd numbers to NaN
my_df[my_df % 2 == 0]

   col1  col2  col3  col4  col5
A   0.0   NaN   2.0   NaN   4.0
B   NaN   6.0   NaN   8.0   NaN
C  10.0   NaN  12.0   NaN  14.0
D   NaN  16.0   NaN  18.0   NaN

In [42]:
#converts all even number to NaN
my_df[my_df % 2 == 1]

   col1  col2  col3  col4  col5
A   NaN   1.0   NaN   3.0   NaN
B   5.0   NaN   7.0   NaN   9.0
C   NaN  11.0   NaN  13.0   NaN
D  15.0   NaN  17.0   NaN  19.0

In [43]:
# fills all odd numbers with 0
my_df[my_df % 2 == 0].fillna(value=0)

   col1  col2  col3  col4  col5
A   0.0   0.0   2.0   0.0   4.0
B   0.0   6.0   0.0   8.0   0.0
C  10.0   0.0  12.0   0.0  14.0
D   0.0  16.0   0.0  18.0   0.0

In [44]:
#fills all even number with 0
my_df[my_df % 2 == 0].fillna(value=0)

   col1  col2  col3  col4  col5
A   0.0   0.0   2.0   0.0   4.0
B   0.0   6.0   0.0   8.0   0.0
C  10.0   0.0  12.0   0.0  14.0
D   0.0  16.0   0.0  18.0   0.0

In [45]:
# fills all odd values with whatever the mean of my_df's original col2 is: (1+6+11+16)/4 = 8.5
my_df[my_df % 2 == 0].fillna(value=my_df['col2'].mean())

   col1  col2  col3  col4  col5
A   0.0   8.5   2.0   8.5   4.0
B   8.5   6.0   8.5   8.0   8.5
C  10.0   8.5  12.0   8.5  14.0
D   8.5  16.0   8.5  18.0   8.5

In [46]:
# fills all even values with whatever the mean of my_df's original col2 is: (1+6+11+16)/4 = 8.5
my_df[my_df % 2 == 1].fillna(value=my_df['col2'].mean())

   col1  col2  col3  col4  col5
A   8.5   1.0   8.5   3.0   8.5
B   5.0   8.5   7.0   8.5   9.0
C   8.5  11.0   8.5  13.0   8.5
D  15.0   8.5  17.0   8.5  19.0

In [47]:
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

In [48]:
#this adds a new column
my_df['newCol'] = [10, 20, 30, 40]
my_df

   col1  col2  col3  col4  col5  newCol
A     0     1     2     3     4      10
B     5     6     7     8     9      20
C    10    11    12    13    14      30
D    15    16    17    18    19      40

In [49]:
#adds a column which is a result of summing two columns
my_df['col1+col2'] = my_df['col1'] + my_df['col2']
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2
A     0     1     2     3     4      10          1
B     5     6     7     8     9      20         11
C    10    11    12    13    14      30         21
D    15    16    17    18    19      40         31

In [50]:
#adds a column which is a result of subtracting two columns
my_df['col1-col2'] = my_df['col1'] - my_df['col2']
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2  col1-col2
A     0     1     2     3     4      10          1         -1
B     5     6     7     8     9      20         11         -1
C    10    11    12    13    14      30         21         -1
D    15    16    17    18    19      40         31         -1

In [51]:
#drops a column
my_df.drop(columns=['newCol'])

   col1  col2  col3  col4  col5  col1+col2  col1-col2
A     0     1     2     3     4          1         -1
B     5     6     7     8     9         11         -1
C    10    11    12    13    14         21         -1
D    15    16    17    18    19         31         -1

In [52]:
#note the changes are not premanent
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2  col1-col2
A     0     1     2     3     4      10          1         -1
B     5     6     7     8     9      20         11         -1
C    10    11    12    13    14      30         21         -1
D    15    16    17    18    19      40         31         -1

In [53]:
#this will make changes permanent
my_df.drop(columns=['newCol', 'col1+col2'], inplace=True)

In [54]:
my_df

   col1  col2  col3  col4  col5  col1-col2
A     0     1     2     3     4         -1
B     5     6     7     8     9         -1
C    10    11    12    13    14         -1
D    15    16    17    18    19         -1

In [55]:
my_df.drop(columns=['col1-col2'], inplace=True)

In [56]:
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

In [57]:
#we will use this dataframe to practice groupby and common operations
my_df = pd.DataFrame({'Type': ['Falcon', 'Falcon', 'Parrot', 'Parrot', 'Cat', 'Cat', 'Cat'],
                      'Max Speed': [380., 370., 24., 26., 50., 50., 150.]})
my_df

     Type  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0
4     Cat       50.0
5     Cat       50.0
6     Cat      150.0

In [58]:
#gets all unique types and max speeds
print(f"unique types: {my_df['Type'].unique()}")
print(f"unique max speeds: {my_df['Max Speed'].unique()}")

unique types: ['Falcon' 'Parrot' 'Cat']
unique max speeds: [380. 370.  24.  26.  50. 150.]

In [59]:
#gets the count of all types
my_df['Type'].value_counts()

Cat       3
Falcon    2
Parrot    2
Name: Type, dtype: int64

In [60]:
#gets the count of all max speeds
my_df['Max Speed'].value_counts()

50.0     2
380.0    1
370.0    1
24.0     1
26.0     1
150.0    1
Name: Max Speed, dtype: int64

In [61]:
print(f"sum of Max Speed col: {my_df['Max Speed'].sum()}")
print(f"mean of Max Speed col: {my_df['Max Speed'].mean()}")
print(f"min from Max Speed col: {my_df['Max Speed'].min()}")
print(f"max from Max Speed col: {my_df['Max Speed'].max()}")

sum of Max Speed col: 1050.0
mean of Max Speed col: 150.0
min from Max Speed col: 24.0
max from Max Speed col: 380.0

In [62]:
#groups and finds the mean of all types
my_df.groupby(by='Type').mean()

         Max Speed
Type
Cat      83.333333
Falcon  375.000000
Parrot   25.000000

In [63]:
#groups and finds the mean of all max speeds
#this is a warning not an error
my_df.groupby(by='Max Speed').mean()

/var/folders/br/n6tjhjf11czfp_gz2m57phfr0000gn/T/ipykernel_32252/1512423521.py:3: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  my_df.groupby(by='Max Speed').mean()

Empty DataFrame
Columns: []
Index: [24.0, 26.0, 50.0, 150.0, 370.0, 380.0]

In [64]:
#this is a practice dataset we will use
pokemon_df = pd.read_csv(filepath_or_buffer='Pokemon.csv')

In [65]:
pokemon_df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [66]:
#summary of all column types
pokemon_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

In [67]:
#adds a column legendary and sets the value to be True for all rows
pokemon_df[pokemon_df['Legendary'] == True]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
156,144,Articuno,Ice,Flying,580,90,85,100,95,125,85,1,True
157,145,Zapdos,Electric,Flying,580,90,90,85,125,90,100,1,True
158,146,Moltres,Fire,Flying,580,90,100,90,125,85,90,1,True
162,150,Mewtwo,Psychic,NaN,680,106,110,90,154,90,130,1,True
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,780,106,190,100,154,100,130,1,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [68]:
pokemon_df[pokemon_df['Legendary'] == True].shape

(65, 13)

In [69]:
#Tells you the # of pokemon with type 1 of fire
pokemon_df[pokemon_df['Type 1'] == 'Fire'].shape

(52, 13)

In [70]:
#Tells you the # of pokemon with type 1 of fire
pokemon_df[pokemon_df['Type 1'] == 'Psychic'].shape

(57, 13)

In [71]:
#finds the max HP for all the pokemon
pokemon_df['HP'].idxmax()

261

In [72]:
#another way for finding the pokemon with maxHP
#we also get all the other information for the pokemon
pokemon_df.iloc[pokemon_df['HP'].idxmax()]

#                 242
Name          Blissey
Type 1         Normal
Type 2            NaN
Total             540
HP                255
Attack             10
Defense            10
Sp. Atk            75
Sp. Def           135
Speed              55
Generation          2
Legendary       False
Name: 261, dtype: object

In [73]:
#this finds the pokemon with largest HP by sorting values in descending order and picking the first row
pokemon_df.sort_values(by='HP',ascending=False).head(1)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
261,242,Blissey,Normal,NaN,540,255,10,10,75,135,55,2,False

In [74]:
pokemon_df.sort_values(by='HP',ascending=False)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
261,242,Blissey,Normal,NaN,540,255,10,10,75,135,55,2,False
121,113,Chansey,Normal,NaN,450,250,5,5,35,105,50,1,False
217,202,Wobbuffet,Psychic,NaN,405,190,33,58,33,58,33,2,False
351,321,Wailord,Water,NaN,500,170,90,45,90,45,60,3,False
655,594,Alomomola,Water,NaN,470,165,75,80,40,45,65,5,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
139,129,Magikarp,Water,NaN,200,20,10,55,15,20,80,1,False
381,349,Feebas,Water,NaN,200,20,15,20,10,55,80,3,False
388,355,Duskull,Ghost,NaN,295,20,40,90,30,90,25,3,False
55,50,Diglett,Ground,NaN,265,10,55,25,35,45,95,1,False
316,292,Shedinja,Bug,Ghost,236,1,90,45,30,30,40,3,False

In [75]:
#finds the number of pokemon for each type 1's
pokemon_df['Type 1'].value_counts()

Water       112
Normal       98
Grass        70
Bug          69
Psychic      57
Fire         52
Electric     44
Rock         44
Dragon       32
Ground       32
Ghost        32
Dark         31
Poison       28
Steel        27
Fighting     27
Ice          24
Fairy        17
Flying        4
Name: Type 1, dtype: int64

In [76]:
#finds the number of pokemon for each type 2's
pokemon_df['Type 2'].value_counts()

Flying      97
Ground      35
Poison      34
Psychic     33
Fighting    26
Grass       25
Fairy       23
Steel       22
Dark        20
Dragon      18
Water       14
Ghost       14
Ice         14
Rock        14
Fire        12
Electric     6
Normal       4
Bug          3
Name: Type 2, dtype: int64

In [77]:
#finds the mean HP for all Type 1's
pokemon_df.groupby(by='Type 1').mean()['HP']

Type 1
Bug         56.884058
Dark        66.806452
Dragon      83.312500
Electric    59.795455
Fairy       74.117647
Fighting    69.851852
Fire        69.903846
Flying      70.750000
Ghost       64.437500
Grass       67.271429
Ground      73.781250
Ice         72.000000
Normal      77.275510
Poison      67.250000
Psychic     70.631579
Rock        65.363636
Steel       65.222222
Water       72.062500
Name: HP, dtype: float64

In [78]:
#finds the mean HP for all Type 2's
pokemon_df.groupby(by='Type 2').mean()['HP']

Type 2
Bug         53.333333
Dark        75.550000
Dragon      82.166667
Electric    88.166667
Fairy       64.304348
Fighting    79.461538
Fire        71.250000
Flying      71.391753
Ghost       59.142857
Grass       62.640000
Ground      77.228571
Ice         90.000000
Normal      63.500000
Poison      58.764706
Psychic     72.212121
Rock        68.071429
Steel       64.636364
Water       62.714286
Name: HP, dtype: float64

In [82]:
#we will practice with our own dataset
#the dataset I chose is about cryptocurrencies between 2018 - 2023
crypto_df = pd.read_csv(filepath_or_buffer='crypto.csv')

In [83]:
#this will give the summary of what kind of information this dataset can give us
#from the summary we know that this dataset stores information for each date between 2018 - 2023
crypto_df.head()

,Type,Date,Open,High,Low,Close,Adj Close,Volume
0,Tether USD,1/1/2018,1.01255,1.01536,1.001530,1.007280,1.007280,1.685300e+09
1,Tether USD,1/2/2018,1.00574,1.00988,0.993250,1.004900,1.004900,2.635860e+09
2,Tether USD,1/3/2018,1.00660,1.02328,1.002640,1.013440,1.013440,2.471690e+09
3,Tether USD,1/4/2018,1.01320,1.01618,0.993822,1.002530,1.002530,3.200130e+09
4,Tether USD,1/5/2018,1.00175,1.00501,0.985915,0.998634,0.998634,3.096620e+09

In [84]:
crypto_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19774 entries, 0 to 19773
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Type       19774 non-null  object
 1   Date       19774 non-null  object
 2   Open       19772 non-null  float64
 3   High       19772 non-null  float64
 4   Low        19772 non-null  float64
 5   Close      19772 non-null  float64
 6   Adj Close  19772 non-null  float64
 7   Volume     19772 non-null  float64
dtypes: float64(6), object(2)
memory usage: 1.2+ MB

In [86]:
#I want to know all the different types of cryptocurrencies in the datasets so I will do this
crypto_df['Type'].unique()

array(['Tether USD', 'Bitcoin USD', 'Ethereum USD', 'TRON USD', 'BNB USD',
       'XRP USD', 'Cardano USD', 'Dogecoin USD', 'Litecoin USD',
       'Polkadot USD', 'EUR/USD', 'GBP/USD'], dtype=object)

In [87]:
#I want to know the mean Volume of all the unique types of crypto currencies so I will do this
#we know that Bitcoin is the most highly traded while BNB is the least
crypto_df.groupby(by='Type').mean()['Volume']

Type
BNB USD         9.925149e+08
Bitcoin USD     2.660023e+10
Cardano USD     1.173425e+09
Dogecoin USD    1.041830e+09
EUR/USD         0.000000e+00
Ethereum USD    1.321567e+10
GBP/USD         0.000000e+00
Litecoin USD    2.399282e+09
Polkadot USD    1.536862e+09
TRON USD        1.026990e+09
Tether USD      4.227927e+10
XRP USD         2.648920e+09
Name: Volume, dtype: float64

In [91]:
#I also want to know the volatitly or how much the stock value changes for each cryptocurrencies
#although this is not perfect, we can get an idea about the volatility by finding the mean of 
#difference between the lows and highs for each crypto, this also tells us the maximum profit someone could
#potentially make in a day by buying and selling a certain stock
#first, I will add a column that gives the high - low to the dataset
crypto_df['High - Low'] = crypto_df['High'] - crypto_df['Low']
crypto_df

,Type,Date,Open,High,Low,Close,Adj Close,Volume,High - Low
0,Tether USD,1/1/2018,1.012550,1.015360,1.001530,1.007280,1.007280,1.685300e+09,0.013830
1,Tether USD,1/2/2018,1.005740,1.009880,0.993250,1.004900,1.004900,2.635860e+09,0.016630
2,Tether USD,1/3/2018,1.006600,1.023280,1.002640,1.013440,1.013440,2.471690e+09,0.020640
3,Tether USD,1/4/2018,1.013200,1.016180,0.993822,1.002530,1.002530,3.200130e+09,0.022358
4,Tether USD,1/5/2018,1.001750,1.005010,0.985915,0.998634,0.998634,3.096620e+09,0.019095
...,...,...,...,...,...,...,...,...,...
19769,GBP/USD,12/26/2022,1.206001,1.209614,1.205400,1.206001,1.206001,0.000000e+00,0.004214
19770,GBP/USD,12/27/2022,1.208357,1.211226,1.200336,1.208415,1.208415,0.000000e+00,0.010890
19771,GBP/USD,12/28/2022,1.202776,1.212415,1.200336,1.202733,1.202733,0.000000e+00,0.012079
19772,GBP/USD,12/29/2022,1.203297,1.207584,1.201548,1.202848,1.202848,0.000000e+00,0.006036
19773,GBP/USD,12/30/2022,1.205662,1.210683,1.201273,1.205633,1.205633,0.000000e+00,0.009410

In [93]:
#this will give us mean difference between High and Lows for each crypto
crypto_df.groupby(by='Type').mean()['High - Low']
#we can generalize that Bitcoin and Ethereum is very volatile, while other currencies are not nearly as volatile
#this shows that Bitcoin and Ethereum has experienced large DAILY changes in their value
#this also shows that people who bought Bitcoin and Ethereum had the highest potential returns

Type
BNB USD           10.504616
Bitcoin USD     1066.867455
Cardano USD        0.043758
Dogecoin USD       0.007110
EUR/USD            0.006875
Ethereum USD      78.341969
GBP/USD            0.009891
Litecoin USD       7.847555
Polkadot USD       1.981467
TRON USD           0.003825
Tether USD         0.010272
XRP USD            0.045502
Name: High - Low, dtype: float64

In [94]:
#to get the overall daily change in value for crypto we will also add Open - Close column
crypto_df['Open - Close'] = crypto_df['Open'] - crypto_df['Close']
crypto_df

,Type,Date,Open,High,Low,Close,Adj Close,Volume,High - Low,Open - Close
0,Tether USD,1/1/2018,1.012550,1.015360,1.001530,1.007280,1.007280,1.685300e+09,0.013830,0.005270
1,Tether USD,1/2/2018,1.005740,1.009880,0.993250,1.004900,1.004900,2.635860e+09,0.016630,0.000840
2,Tether USD,1/3/2018,1.006600,1.023280,1.002640,1.013440,1.013440,2.471690e+09,0.020640,-0.006840
3,Tether USD,1/4/2018,1.013200,1.016180,0.993822,1.002530,1.002530,3.200130e+09,0.022358,0.010670
4,Tether USD,1/5/2018,1.001750,1.005010,0.985915,0.998634,0.998634,3.096620e+09,0.019095,0.003116
...,...,...,...,...,...,...,...,...,...,...
19769,GBP/USD,12/26/2022,1.206001,1.209614,1.205400,1.206001,1.206001,0.000000e+00,0.004214,0.000000
19770,GBP/USD,12/27/2022,1.208357,1.211226,1.200336,1.208415,1.208415,0.000000e+00,0.010890,-0.000058
19771,GBP/USD,12/28/2022,1.202776,1.212415,1.200336,1.202733,1.202733,0.000000e+00,0.012079,0.000043
19772,GBP/USD,12/29/2022,1.203297,1.207584,1.201548,1.202848,1.202848,0.000000e+00,0.006036,0.000449
19773,GBP/USD,12/30/2022,1.205662,1.210683,1.201273,1.205633,1.205633,0.000000e+00,0.009410,0.000029

In [96]:
#even from this, we can see that Bitcoin is much more volatile compared to other cryptocurrencies
crypto_df.groupby(by='Type').mean()['Open - Close']

Type
BNB USD        -0.098397
Bitcoin USD     1.010964
Cardano USD     0.000261
Dogecoin USD   -0.000044
EUR/USD        -0.000032
Ethereum USD   -0.012457
GBP/USD        -0.000026
Litecoin USD    0.111339
Polkadot USD    0.009546
TRON USD        0.000003
Tether USD     -0.000013
XRP USD         0.001115
Name: Open - Close, dtype: float64

In [98]:
#the highest a crypto was Bitcoin on 11/10/2021 ever worth was 68789.625 USD
crypto_df.iloc[crypto_df['High'].idxmax()]

Type              Bitcoin USD
Date               11/10/2021
Open              66953.33594
High                68789.625
Low               63208.11328
Close             64995.23047
Adj Close         64995.23047
Volume          48730828378.0
High - Low         5581.51172
Open - Close       1958.10547
Name: 3235, dtype: object

In [100]:
#the lowest a crypto was ever worth was DogeCoin on 3/13/2020 with a value of .001247 USD
crypto_df.iloc[crypto_df['Low'].idxmin()]

Type            Dogecoin USD
Date               3/13/2020
Open                 0.00154
High                0.001799
Low                 0.001247
Close               0.001738
Adj Close           0.001738
Volume           218676976.0
High - Low          0.000552
Open - Close       -0.000198
Name: 13584, dtype: object